.github/recovery/59i-ci-driver-repairs/saturation-mutation-mode.patch
diff --git a/.github/workflows/increment-59i-composite-saturation.yml b/.github/workflows/increment-59i-composite-saturation.yml
index 335807b35dffc7b45aa72daf067ca43ebc58395b..e362a5ea2ac31137ef945cf566152ac0732203e2 100644
--- a/.github/workflows/increment-59i-composite-saturation.yml
+++ b/.github/workflows/increment-59i-composite-saturation.yml
@@ -274,14 +274,30 @@ jobs:
           Path(sys.argv[2]).write_text(changed)
           PY
           iverilog -g2001 -Wall -tnull "$out/mutated.v"
-          sed "s|$fields|$out/mutated.v|g" "$out/prove.ys" > "$out/mutation.ys"
+          python3 - "$fields" "$out" <<'PY_MUTATION'
+          from pathlib import Path
+          import sys
+          fields, out = sys.argv[1], Path(sys.argv[2])
+          positive = (out / 'prove.ys').read_text()
+          assert positive.count(' -verify ') == 1
+          assert positive.count(fields) == 1
+          negative = positive.replace(fields, str(out / 'mutated.v'), 1).replace(' -verify ', ' -falsify ', 1)
+          negative = negative.rstrip('\n') + ' -dump_vcd "' + str(out / 'mutation-counterexample.vcd') + '"\n'
+          (out / 'mutation.ys').write_text(negative)
+          PY_MUTATION
           set +e
           yosys -Q -T -s "$out/mutation.ys" > "$out/mutation.log" 2>&1
           mutation_status=$?
           set -e
-          test "$mutation_status" -ne 0
-          grep -q 'model found' "$out/mutation.log"
-          ! grep -q 'timeout' "$out/mutation.log"
+          python3 - "$mutation_status" "$out" <<'PY_MUTATION_RESULT'
+          from pathlib import Path
+          import runpy, sys
+          status, out = int(sys.argv[1]), Path(sys.argv[2])
+          scope = runpy.run_path('morphhdl/scripts/check-increment-60f-equivalence-closure.py')
+          scope['classify_solver'](status, (out / 'mutation.log').read_text(), scope['SAT_FAIL'])
+          model = out / 'mutation-counterexample.vcd'
+          assert model.is_file() and model.stat().st_size > 0, 'missing actual mutation counterexample'
+          PY_MUTATION_RESULT
 
       - uses: actions/upload-artifact@v4
         if: always()
